Repository: abugeek/vaznim
Catalog: lib/data/l10n/app_*.arb
Languages: uz

# language
source: English
uz: O'zbek

# bmiCalc
source: BMI Calculator
uz: TMI Hisoblagichi

source: Male
uz: Erkak

source: Female
uz: Ayol

source: Height
uz: Bo'y

source: cm
uz: sm

source: Weight
uz: O'g'irlik

source: Age
uz: Yosh

source: Calculate
uz: Hisoblash

source: Re-Calculate
uz: Qayta-Hisoblash

source: Your Result
uz: Natijangiz

# yourbmi
source: Your BMI is
uz: Sizning TMI natijangiz

source: Overweight
uz: Ortiqcha vazn

source: Underweight
uz: Kam vazn

# overText
source: You have a higher than normal body weight. The best way to lose weight if you're overweight is through a combination of diet and exercise.
uz: Sizda normal tana vaznidan yuqori. Agar sizda ortiqcha vazn bo'lsa, vazn yo'qotishning eng yaxshi usuli bu parhez va jismoniy mashqlar kombinatsiyasi.

# normalText
source: You have a normal body weight. Keep up the good work!
uz: Sizning tana vazningiz normal. O'zingizni yaxshi saqlashda davom eting!

# underText
source: You have a lower than normal body weight. Being underweight could be a sign you're not eating enough or you may be ill. You can eat a bit more.
uz: Sizning tana vazningizdan normadan pastroq. Kam vazn, siz etarlicha ovqatlanmayotganingiz yoki kasal bo'lishingiz mumkin bo'lgan belgi bo'lishi mumkin. Siz bir oz ko'proq eyishingiz mumkin.

# firstQ
source: What is the BMI?
uz: TMI nima?

# firstA
source: BMI is an acronym for Body Mass Index, and it is an indicator of the amount of fat which is stored in the human body. It provides a measure of the appropriateness of your weight to your height, based on health issues which are known to arise as a result of having a BMI which is too low or too high.
uz: TMI - tana massasi indeksining qisqartmasi bo'lib, u inson tanasida saqlanadigan yog ' miqdorining ko'rsatkichidir. Bu sizning bo'yingiz va vazningiz asosidagi o'lchov birligidur, juda past yoki juda yuqori bo'lgan TMI natijasi sog'ligingizda muammo borligini bildiradi.

# secondQ
source: How is BMI calculated?
uz: TMI qanday hisoblanadi?

# secondA
source: BMI is calculated using only the variables of weight and height. Your BMI is equal to your weight in kilograms divided by your height in metres squared.
uz: TMI faqat vazn va bo'y o'zgaruvchilari yordamida hisoblanadi. Sizning TMI natijangiz vazningiz va bo'yingizni taqsimlagan holdagi natijasiga teng.

# thirdQ
source: What is the ideal BMI?
uz: Ideal TMI nechchi?

# thirdA
source: The ideal BMI is between 18.5 and 25 kg/m2. This is the range of body weight which is normal for a healthy person. If your BMI is outside this range, you may be underweight or overweight.
uz: Ideal TMI 18,5 va 25 kg/m2 orasida. Bu sog'lom odam uchun normal bo'lgan tana vaznining diapazoni. Agar sizning BMI ushbu doiradan tashqarida bo'lsa, siz kam vazn yoki ortiqcha vaznga ega bo'lishingiz mumkin.

# fourthQ
source: Is BMI officially recognised?
uz: TMI rasman tan olinganmi?

# fourthA
source: Yes, BMI is officially recognised by the World Health Organisation, and it is endorsed by a wide range of government agencies and medical organisations throughout the world. This official recognition has led to BMI being used extensively in both the public and private sectors in all developed countries.
uz: Ha, TMI jahon Sog'liqni Saqlash Tashkiloti tomonidan rasman tan olingan va u butun dunyo bo'ylab ko'plab davlat idoralari va tibbiyot tashkilotlari tomonidan tasdiqlangan. Ushbu rasmiy e'tirof TMIning barcha rivojlangan mamlakatlarda ham davlat, ham xususiy sektorda keng qo'llanilinadi.
